package com.educational.events.model.enums;

/**
 * Тип расширенного фильтра по полю модели.
 */
public enum AdvancedFieldFilterType {

    /**
     * Точное равенство.
     */
    EQUALS,

    /**
     * Поиск по вхождению строки.
     */
    CONTAINS,

    /**
     * Поиск по совпадению с элементом списка.
     */
    IN,

    /**
     * Поиск по отсутствию совпадений с элементом списка.
     */
    NOT_IN,

    /**
     * Значение поля равно null.
     */
    IS_NULL,

    /**
     * Значение поля не равно null.
     */
    IS_NOT_NULL,

    /**
     * Значение поля больше значения фильтра.
     * Используется для полей с типом Дата.
     */
    GREATER,

    /**
     * Значение поля больше значения фильтра или NULL.
     * Используется для полей с типом Дата.
     */
    GREATER_OR_NULL,

    /**
     * Значение поля больше или равно значения фильтра.
     * Используется для полей с типом Дата.
     */
    GREATER_OR_EQUALS,

    /**
     * Значение поля больше или равно значению фильтра.
     * Используется для полей с типом Дата.
     */
    GREATER_OR_EQUALS_OR_NULL,

    /**
     * Значение поля меньше значения фильтра.
     * Используется для полей с типом Дата.
     */
    LOWER,

    /**
     * Значение поля меньше значения фильтра или NULL.
     * Используется для полей с типом Дата.
     */
    LOWER_OR_NULL,

    /**
     * Значение поля меньше или равно значения фильтра.
     * Используется для полей с типом Дата.
     */
    LOWER_OR_EQUALS,

    /**
     * Значение поля меньше или равно значения фильтра или NULL.
     * Используется для полей с типом Дата.
     */
    LOWER_OR_EQUALS_OR_NULL,

    /**
     * Точное равенство или NULL.
     */
    EQUALS_OR_NULL,

    /**
     * Точное равенство без учета регистра или NULL.
     */
    EQUALS_IGNORE_CASE_OR_NULL,

    /**
     * Точное равенство без учета регистра.
     */
    EQUALS_IGNORE_CASE,

    /**
     * Выбор диапазона между двумя значениями (включительно).
     */
    BETWEEN,

    /**
     * Выбор диапазона не входящий между двумя значениями (включительно).
     */

    OUTSIDE,

    /**
     * Не равно.
     */
    NOT_EQUALS,

    /**
     * Поиск по совпадению с элементом списка или NULL.
     */
    IN_OR_NULL,

    /**
     * Поиск по отсутствию совпадения с элементом списка или NULL.
     */
    NOT_IN_OR_NULL,

    /**
     * Поиск элементов начинающихся на заданный набор символов.
     */
    START_WITH,

    /**
     * Поиск элементов не начинающихся на заданный набор символов.
     */
    NOT_START_WITH,

    /**
     * Поиск по вхождению строки или равно null.
     */
    CONTAINS_OR_NULL,

    /**
     * Не равно и не NULL.
     */
    NOT_EQUALS_AND_NOT_NULL,

    /**
     * NULL или меньше или равно.
     */
    IS_NULL_OR_LOWER_OR_EQUALS,

    /**
     * Длина значения равна.
     */
    EQUALS_LENGTH,

}
